<?php

namespace Database\Seeders;

use App\Models\Font;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class FontSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $f=new Font();
        $f->id=1;
        $f->naziv="Етар РНИДС";
        $f->opis='Етар РНИДС је сансерифно писмо сведене конструкције и неутралног израза. Припада групи гротескних писама која се данас често користе, како у штампи тако и на вебу.

        Фонтови су: Etar RNIDS-Regular, Etar RNIDS-Italic, Etar RNIDS-Bold и Etar RNIDS-BoldItalic.';
        $f->resurs_id=1;
        $f->objavljen=true;
        $f->save();

        $f=new Font();
        $f->id=2;
        $f->naziv="Лингва РНИДС";
        $f->opis='Лингва РНИДС је серифно типографско писмо прелазног типа, изведено у усправном и курзивном облику. Већа и мања тежина овог писма су погодне за наслове и за крупнији приказ, док је нормална тежина читљива и у ситнијим текстовима.

        Фонтови су: Lingva RNIDS-Thin, Lingva RNIDS-Regular, Lingva RNIDS-Bold и Lingva RNIDS-Italic';
        $f->link_detaljno='https://www.tipometar.org/aktuelno/akcija!/Lingva/img/01.html';
        $f->resurs_id=1;
        $f->objavljen=true;
        $f->save();

        $f=new Font();
        $f->id=3;
        $f->naziv="Орто РНИДС";
        $f->opis='Орто РНИДС је сансерифно типографско писмо хуманистичког типа изведено у усправном и курзивном облику, у две тежине. Креирано је са идејом да се облици слова добро прилагоде приказу на екрану, а подједнако добро понаша се и при употреби у штампи.

        Фонтови су: Orto RNIDS-Regular, Orto RNIDS-Italic, Orto RNIDS-Bold и Orto RNIDS-BoldItalic.';
        $f->link_detaljno='https://www.tipometar.org/aktuelno/akcija!/Orto/img/01.html';
        $f->resurs_id=1;
        $f->objavljen=true;
        $f->save();

        $f=new Font();
        $f->id=4;
        $f->naziv="Ареал РНИДС";
        $f->opis='Ареал РНИДС је слабсерифно типографско писмо изведено у усправном и курзивном облику, у две тежине. Његове пропорције, једноставни облици и линеарни карактер чине га добро читљивим у малим величинама. Посебна пажња посвећена је оптимизацији за екрански приказ.

        Фонтови су: Areal RNIDS-Regular, Areal RNIDS-Italic, Areal RNIDS-Bold и Areal RNIDS-BoldItalic.';
        $f->link_detaljno='https://www.tipometar.org/aktuelno/akcija!/Areal/img/01.html';
        $f->resurs_id=1;
        $f->objavljen=true;
        $f->save();

        $f=new Font();
        $f->id=5;
        $f->naziv="Оптина";
        $f->opis='Типометар и Министарство културе и информисања Републике Србије вам поклањају 3 фамилије са по 4 фонта типографског писма Оптина аутора Оливере Стојадиновић, у форматима који се користе на интернету и у штампи, као и у облику варијабилног фонта у веб-формату који у себи садржи све облике овог писма настале променом тежине и оптичке величине.

        Писмо Оптина састоји се из три усправне санс-серифне фамилије: Микро, Нормал и Дисплеј. Свака од ових фамилија садржи по 4 фонта (Thin, Regular, Bold, Black) у тежинама од најмање до највеће, укупно 12 фонтова. Ови фонтови садрже слова ћирилице, латинице, бројеве, интерпункцију и све друге потребне знакове.';
        $f->link_detaljno='https://www.tipometar.org/aktuelno/akcija!/Optina/img/01.html';
        $f->resurs_id=1;
        $f->objavljen=true;
        $f->save();
        
        $f=new Font();
        $f->id=6;
        $f->naziv="ДИЈАКРИТИКА";
        $f->opis='Реализацију овог пројекта подржало је Министарство културе и информисања Републике Србије.

        Усправном фонту Дијакритика који је реализован у 2017. години и курзивном из 2018. године, сада се придружује и усправни фонт у већој тежини – болд. Фамилија Дијакритика сада се састоји из три фонта: Dijakritika-Regular, Dijakritika-Italic и Dijakritika-Bold у .otf и .woff2 формату.';
        $f->link_detaljno='https://www.tipometar.org/aktuelno/akcija!/Dijakritika/img/01.html';
        $f->resurs_id=1;
        $f->objavljen=true;
        $f->save();

        $f=new Font();
        $f->id=7;
        $f->naziv="Ноктурно БГ";
        $f->opis='Ноктурно БГ је књижно писмо складних пропорција чији су облици засновани на елегантним облим формама и израженом контрасту између танких и дебелих потеза. Основни нагласак је на благо издуженим словима и финим серифима који дају мекоћу тексту.

        Ноктурно БГсе добро понаша при слагању текстова мањим и већим величинама. Иако је намењен првенствено књижном слогу, своју примену налази и у графичком дизајну.';
        $f->resurs_id=1;
        $f->objavljen=true;
        $f->save();

        $f=new Font();
        $f->id=8;
        $f->naziv="Ресавска БГ";
        $f->opis='Ресавска БГ је серифно, књижно писмо, погодно за различите намене и широки круг корисника. Фонтови садрже слова српске ћирилице, основне латинице, знаке интерпункције и специјалне знаке потребне за слагање текста.';
        $f->resurs_id=1;
        $f->objavljen=true;
        $f->save();

        $f=new Font();
        $f->id=9;
        $f->naziv="Адамант БГ";
        $f->opis='Адамант БГ је серифно писмо савремених пропорција, пројектовано тако да буде веома читљиво у малим величинама и лошим условима штампе, па је погодно за коришћење у новинама и часописима, али и у свим областима графичког дизајна.
        Фонтови садрже сва слова и знаке из основног латиничног кодног распореда, као и слова српске ћирилице и латинице.
        Фонтови су у OpenType формату, с обзиром да сви савремени оперативни системи и рачунарски програми могу да препознају и користе тај формат.';
        $f->resurs_id=1;
        $f->objavljen=true;
        $f->save();
    }
}
